c5/src/Documents/LVITransfer/LVITransfer.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>LVITransfer</name>
  <registerRecords>AccountingRegister.General</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Account</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Department</name>
      <type>
        <types>CatalogRef.Departments</types>
      </type>
    </attributes>
    <attributes>
      <name>DepartmentReceiver</name>
      <type>
        <types>CatalogRef.Departments</types>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>EmployeeReceiver</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Series</name>
      <type>
        <types>CatalogRef.Series</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/AccountingRegisters/General/General.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>General</name>
  <chartOfAccounts>ChartOfAccounts.General</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
    <accountingFlag>ChartOfAccounts.General.AccountingFlag.Currency</accountingFlag>
  </dimensions>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.Quantity</types>
    </type>
    <accountingFlag>ChartOfAccounts.General.AccountingFlag.Quantitative</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.General.ExtDimensionAccountingFlag.Quantitative</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.General.ExtDimensionAccountingFlag.Accrual</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>CurrencyAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
    <accountingFlag>ChartOfAccounts.General.AccountingFlag.Currency</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.General.ExtDimensionAccountingFlag.Currency</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Content</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Operation</name>
    <type>
      <types>EnumRef.Operations</types>
    </type>
  </attributes>
  <attributes>
    <name>Dependency</name>
    <type>
      <types>DocumentRef.Payment</types>
      <types>DocumentRef.VendorInvoice</types>
      <types>DocumentRef.CustomsDeclaration</types>
      <types>DocumentRef.Production</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

c5/src/Enums/Operations/Operations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Operations</name>
  <enumValues>
    <name>AdditionalExpenses</name>
  </enumValues>
  <enumValues>
    <name>AdjustAdvances</name>
  </enumValues>
  <enumValues>
    <name>AdjustDebts</name>
  </enumValues>
  <enumValues>
    <name>AdjustVendorAdvances</name>
  </enumValues>
  <enumValues>
    <name>AdjustVendorDebts</name>
  </enumValues>
  <enumValues>
    <name>AdvanceApplied</name>
  </enumValues>
  <enumValues>
    <name>AdvanceGiven</name>
  </enumValues>
  <enumValues>
    <name>AdvanceTaken</name>
  </enumValues>
  <enumValues>
    <name>Assembling</name>
  </enumValues>
  <enumValues>
    <name>AutoWritingOffForm</name>
  </enumValues>
  <enumValues>
    <name>BankExpense</name>
  </enumValues>
  <enumValues>
    <name>BankReceipt</name>
  </enumValues>
  <enumValues>
    <name>CashExpense</name>
  </enumValues>
  <enumValues>
    <name>CashReceipt</name>
  </enumValues>
  <enumValues>
    <name>CustomerPayment</name>
  </enumValues>
  <enumValues>
    <name>CustomerRefund</name>
  </enumValues>
  <enumValues>
    <name>Disassembling</name>
  </enumValues>
  <enumValues>
    <name>ExpenseReceipt</name>
  </enumValues>
  <enumValues>
    <name>FixedAssetsDepreciation</name>
  </enumValues>
  <enumValues>
    <name>FixedAssetsReceipt</name>
  </enumValues>
  <enumValues>
    <name>IncomeTaxWithheld</name>
  </enumValues>
  <enumValues>
    <name>IntangibleAssetsAmortization</name>
  </enumValues>
  <enumValues>
    <name>IntangibleAssetsReceipt</name>
  </enumValues>
  <enumValues>
    <name>Invoice</name>
  </enumValues>
  <enumValues>
    <name>ItemsCost</name>
  </enumValues>
  <enumValues>
    <name>ItemsReceipt</name>
  </enumValues>
  <enumValues>
    <name>ItemsRetirement</name>
  </enumValues>
  <enumValues>
    <name>ItemsReturn</name>
  </enumValues>
  <enumValues>
    <name>LVIExploitation</name>
  </enumValues>
  <enumValues>
    <name>LVITransfer</name>
  </enumValues>
  <enumValues>
    <name>LVIWriteOff</name>
  </enumValues>
  <enumValues>
    <name>NegativeCurrencyDifference</name>
  </enumValues>
  <enumValues>
    <name>OffsetVATImport</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
  <enumValues>
    <name>OtherReceipt</name>
  </enumValues>
  <enumValues>
    <name>PaymentReturn</name>
  </enumValues>
  <enumValues>
    <name>PositiveCurrencyDifference</name>
  </enumValues>
  <enumValues>
    <name>ProductionOutput</name>
  </enumValues>
  <enumValues>
    <name>Sales</name>
  </enumValues>
  <enumValues>
    <name>SalesDiscount</name>
  </enumValues>
  <enumValues>
    <name>SalesTax</name>
  </enumValues>
  <enumValues>
    <name>Transfer</name>
  </enumValues>
  <enumValues>
    <name>VATAdvances</name>
  </enumValues>
  <enumValues>
    <name>VATAdvancesReverse</name>
  </enumValues>
  <enumValues>
    <name>VATDiscount</name>
  </enumValues>
  <enumValues>
    <name>VATPayable</name>
  </enumValues>
  <enumValues>
    <name>VATReceivable</name>
  </enumValues>
  <enumValues>
    <name>VendorPayment</name>
  </enumValues>
  <enumValues>
    <name>VendorRefund</name>
  </enumValues>
  <enumValues>
    <name>WriteoffCharges</name>
  </enumValues>
</mdclass:Enum>

c5/src/Catalogs/Packages/Packages.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Packages</name>
  <owners>Catalog.Items</owners>
  <attributes>
    <name>Capacity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Height</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Length</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Unit</name>
    <type>
      <types>CatalogRef.Units</types>
    </type>
  </attributes>
  <attributes>
    <name>UPC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Weight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Width</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

c5/src/ChartsOfCharacteristicTypes/Dimensions/Dimensions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>Dimensions</name>
  <type>
    <types>EnumRef.FixedAssetGroups</types>
    <types>CatalogRef.Organizations</types>
    <types>CatalogRef.FixedAssets</types>
    <types>CatalogRef.Expenses</types>
    <types>CatalogRef.Warehouses</types>
    <types>ChartOfCalculationTypesRef.Compensations</types>
    <types>CatalogRef.Employees</types>
    <types>CatalogRef.Addresses</types>
    <types>CatalogRef.Taxes</types>
    <types>CatalogRef.PaymentLocations</types>
    <types>CatalogRef.Contracts</types>
    <types>CatalogRef.Departments</types>
    <types>CatalogRef.Dimensions</types>
    <types>CatalogRef.Items</types>
    <types>CatalogRef.Individuals</types>
    <types>String</types>
    <types>CatalogRef.IntangibleAssets</types>
    <types>CatalogRef.BankAccounts</types>
    <types>CatalogRef.CashFlows</types>
    <types>CatalogRef.VAT</types>
    <types>EnumRef.IncomeCodes</types>
    <stringQualifiers>
      <length>150</length>
    </stringQualifiers>
  </type>
  <predefined>
    <items>
      <name>Addresses</name>
      <description>Addresses</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.Addresses</types>
      </type>
    </items>
    <items>
      <name>AssetsCategories</name>
      <description>Assets Categories</description>
      <code>000000016</code>
      <type>
        <types>EnumRef.FixedAssetGroups</types>
      </type>
    </items>
    <items>
      <name>BankAccounts</name>
      <description>Bank Accounts</description>
      <code>000000009</code>
      <type>
        <types>CatalogRef.BankAccounts</types>
      </type>
    </items>
    <items>
      <name>CashFlows</name>
      <description>Cash Flows</description>
      <code>000000015</code>
      <type>
        <types>CatalogRef.CashFlows</types>
      </type>
    </items>
    <items>
      <name>Compensations</name>
      <description>Compensations</description>
      <code>000000014</code>
      <type>
        <types>ChartOfCalculationTypesRef.Compensations</types>
      </type>
    </items>
    <items>
      <name>Contracts</name>
      <description>Contracts</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Contracts</types>
      </type>
    </items>
    <items>
      <name>Departments</name>
      <description>Departments</description>
      <code>000000007</code>
      <type>
        <types>CatalogRef.Departments</types>
      </type>
    </items>
    <items>
      <name>Employees</name>
      <description>Employees</description>
      <code>000000013</code>
      <type>
        <types>CatalogRef.Individuals</types>
      </type>
    </items>
    <items>
      <name>Expenses</name>
      <description>Expenses</description>
      <code>000000008</code>
      <type>
        <types>CatalogRef.Expenses</types>
      </type>
    </items>
    <items>
      <name>FixedAssets</name>
      <description>Fixed assets</description>
      <code>000000011</code>
      <type>
        <types>CatalogRef.FixedAssets</types>
      </type>
    </items>
    <items>
      <name>IncomeCodes</name>
      <description>Income Tax Codes</description>
      <code>000000018</code>
      <type>
        <types>EnumRef.IncomeCodes</types>
      </type>
    </items>
    <items>
      <name>IntangibleAssets</name>
      <description>Intangible Assets</description>
      <code>000000012</code>
      <type>
        <types>CatalogRef.IntangibleAssets</types>
      </type>
    </items>
    <items>
      <name>Items</name>
      <description>Items</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </items>
    <items>
      <name>Organizations</name>
      <description>Organizations</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Organizations</types>
      </type>
    </items>
    <items>
      <name>PaymentLocations</name>
      <description>Payment Locations</description>
      <code>000000010</code>
      <type>
        <types>CatalogRef.PaymentLocations</types>
      </type>
    </items>
    <items>
      <name>Taxes</name>
      <description>Taxes</description>
      <code>000000017</code>
      <type>
        <types>CatalogRef.Taxes</types>
      </type>
    </items>
    <items>
      <name>VAT</name>
      <description>VAT</description>
      <code>000000019</code>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </items>
    <items>
      <name>Warehouses</name>
      <description>Warehouses</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>DescriptionRu</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

c5/src/Documents/LVITransfer/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure PresentationFieldsGetProcessing ( Fields, StandardProcessing )
	
	StandardProcessing = false;
	Fields.Add ( "Date" );
	Fields.Add ( "Number" );
	
EndProcedure

Procedure PresentationGetProcessing ( Data, Presentation, StandardProcessing )
	
	StandardProcessing = false;
	Presentation = Metadata.Documents.LVITransfer.Synonym + " #" + Data.Number + " " + Format ( Data.Date, "DLF=D" );
	
EndProcedure

#region Posting

Function Post ( Env ) export
	
	getData ( Env );
	if ( not makeValues ( Env ) ) then
		return false;
	endif;
	flagRegisters ( Env );
	return true;
	
EndFunction

Procedure getData ( Env )

	sqlFields ( Env );
	getFields ( Env );
	sqlItems ( Env );
	getItems ( Env );
	
EndProcedure

Procedure sqlFields ( Env )
	
	s = "
	|// @Fields
	|select Document.Date as Date, Document.Company as Company, Document.PointInTime as Timestamp
	|from Document.LVITransfer as Document
	|where Document.Ref = &Ref
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure getFields ( Env )
	
	Env.Q.SetParameter ( "Ref", Env.Ref );
	SQL.Perform ( Env );
	
EndProcedure 

Procedure sqlItems ( Env )
	
	s = "
	|select Items.LineNumber as LineNumber, Items.Item as Item, Items.Employee.Individual as Employee, Items.EmployeeReceiver.Individual as EmployeeReceiver,
	|	Items.Quantity as Quantity, Items.Account as Account, Items.Department as Department, Items.DepartmentReceiver as DepartmentReceiver,
	|	case when Items.Item.CountPackages then Items.Capacity else 1 end as Capacity,
	|	case when Items.Item.CountPackages then Items.Package.Description else Items.Item.Unit.Code end as Unit,
	|	case when Items.Item.CountPackages then Items.QuantityPkg else Items.Quantity end as QuantityPkg,
	|	case when Items.Item.CountPackages then Items.Package else value ( Catalog.Packages.EmptyRef ) end as Package
	|into Items
	|from Document.LVITransfer.Items as Items
	|where Items.Ref = &Ref
	|index by Items.Item
	|;
	|select Items.Item as Item, Sum ( Items.Quantity ) as Quantity, Items.Account as Account, Items.Department as Department,
	|	Items.DepartmentReceiver as DepartmentReceiver, Items.Employee as Employee, Items.EmployeeReceiver as EmployeeReceiver
	|into ItemsGrouped
	|from Items as Items
	|group by Items.Item, Items.Account, Items.Department, Items.DepartmentReceiver, Items.Employee, Items.EmployeeReceiver
	|;
	|// ^Items
	|select Items.LineNumber as LineNumber, Items.Item as Item, Items.Employee as Employee, Items.EmployeeReceiver as EmployeeReceiver,
	|	Items.Quantity as Quantity, Items.Account as Account, Items.Department as Department, Items.DepartmentReceiver as DepartmentReceiver,
	|	Items.Capacity as Capacity, Items.Unit as Unit,Items.QuantityPkg as QuantityPkg,Items.Package as Package
	|from Items as Items
	|";
	Env.Selection.Add ( s );
	
EndProcedure
 
Procedure getItems ( Env )
	
	SQL.Perform ( Env );
	
EndProcedure 

Function makeValues ( Env )

	lockCost ( Env );
	cost = undefined;
	if ( not calcCost ( Env, cost ) ) then
		return false;
	endif;
	commitCost ( Env, cost );
	return true;

EndFunction

Procedure lockCost ( Env )
	
	table = SQL.Fetch ( Env, "$Items" );
	if ( table.Count () > 0 ) then
		lock = new DataLock ();
		item = lock.Add ( "AccountingRegister.General");
		item.Mode = DataLockMode.Exclusive;
		item.DataSource = table;
		item.UseFromDataSource ( "Account", "Account" );
		dims = ChartsOfCharacteristicTypes.Dimensions;
		item.UseFromDataSource ( dims.Items, "Item" );
		item.UseFromDataSource ( dims.Departments, "Department" );
		item.UseFromDataSource ( dims.Employees, "Employee" );
		lock.Lock ();
	endif;
	
EndProcedure

Function calcCost ( Env, Cost )
	
	table = SQL.Fetch ( Env, "$Items" );
	Cost = getCost ( Env, table );
	error = ( table.Count () > 0 );
	if ( error ) then
		completeCost ( Env, Cost, table );
		return false;
	endif; 
	return true;
	
EndFunction

Function getCost ( Env, Items )
	
	sqlCost ( Env );
	SQL.Prepare ( Env );
	q = Env.Q;
	q.SetParameter ( "Timestamp", ? ( Env.Realtime, undefined, Env.Fields.Timestamp ) );
	cost = q.Execute ().Unload ();
	p = new Structure ();
	p.Insert ( "FilterColumns", "Item, Department, Account, Employee" );
	p.Insert ( "KeyColumn", "Quantity" );
	p.Insert ( "KeyColumnAvailable", "QuantityBalance" );
	p.Insert ( "AddInTable1FromTable2", "DepartmentReceiver, Capacity, EmployeeReceiver" );
	return CollectionsSrv.Decrease ( cost, Items, p );
	
EndFunction 

Procedure sqlCost ( Env )
	
	s = "
	|select Balances.QuantityBalance as Quantity,
	|	Items.Item as Item, Items.Department as Department, Balances.AmountBalance as Amount,
	|	Items.Account as Account, Items.Employee
	|from AccountingRegister.General.Balance(&Timestamp, Account in ( select Account from ItemsGrouped ), , 
	|	(ExtDimension1, ExtDimension2, ExtDimension3) in ( select Item, Department, Employee from ItemsGrouped ) ) as Balances
	|	//
	|	// Items
	|	//
	|	left join ItemsGrouped as Items
	|	on Items.Item = Balances.ExtDimension1
	|	and Items.Department = Balances.ExtDimension2
	|	and Items.Employee = Balances.ExtDimension3
	|	and Balances.QuantityBalance > 0
	|";
	Env.Selection.Add ( s );
	
EndProcedure

Procedure completeCost ( Env, Cost, Items )
	
	column = ? ( Options.Packages (), "QuantityPkg", "Quantity" );
	msg = Posting.Msg ( Env, "Item, QuantityBalance, Quantity, Department, Employee" );
	ref = Env.Ref;
	for each row in Items do
		costRow = Cost.Add ();
		FillPropertyValues ( costRow, row );
		msg.Item = row.Item;
		msg.Department = row.Department;
		msg.Employee = row.Employee;
		quantityBalance = row.QuantityBalance;
		unit = row.Unit;
		msg.QuantityBalance = Conversion.NumberToQuantity ( quantityBalance, unit );
		msg.Quantity = Conversion.NumberToQuantity ( row.Quantity - quantityBalance, unit );
		Output.LVIBalanceError ( msg, Output.Row ( "Items", row.LineNumber, column ), ref );
	enddo; 
		
EndProcedure 

Procedure commitCost ( Env, Table )
	
	if ( Env.RestoreCost ) then
		cleanCost ( Env );
	endif;
	groupColumns = "Item, Account, Department, DepartmentReceiver, Employee, EmployeeReceiver, Capacity";
	sumColumns = "Quantity, Amount";
	items = Table.Copy ( , groupColumns + ", " + sumColumns );
	items.GroupBy ( groupColumns, sumColumns );
	p = GeneralRecords.GetParams ();
	p.Date = Env.Fields.Date;
	p.Company = Env.Fields.Company;
	p.Operation = Enums.Operations.LVITransfer;
	p.DimDr1Type = "Items";
	p.DimDr2Type = "Departments";
	p.DimDr3Type = "Employees";
	p.Recordset = Env.Registers.General;
	for each row in items do
		quantity = row.Quantity * row.Capacity;
		item = row.Item;
		p.AccountDr = row.Account;
		p.AccountCr = row.Account;
		p.QuantityDr = quantity;
		p.QuantityCr = quantity;
		p.Amount =  row.Amount;
		p.DimDr1 = item;
		p.DimDr2 = row.DepartmentReceiver;
		p.DimDr3 = row.EmployeeReceiver;
		p.DimCr1 = item;
		p.DimCr2 = row.Department;
		p.DimCr3 = row.Employee;
		GeneralRecords.Add ( p );
	enddo; 
	
EndProcedure

Procedure cleanCost ( Env )
	
	recordset = Env.Registers.General;
	recordset.Read ();
	i = recordset.Count () - 1;
	while ( i >= 0 ) do
		if ( recordset [ i ].Operation = Enums.Operations.Transfer ) then
			recordset.Delete ( i );
		endif; 
		i = i - 1;
	enddo; 
	
EndProcedure

Procedure flagRegisters ( Env )
	
	Env.Registers.General.Write = true;
	
EndProcedure

#endregion

#endif
